Merge branch 'master' into docs/audit-and-refine
